---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Corner
source: html/0bcff3e9-28ce-b3bc-e12c-a115807de89f.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Corner Property

The lower-left coordinate for the analytical rectangular geometry viewed from outside.

## Syntax (C#)
```csharp
public XYZ Corner { get; }
```

## Remarks
The analytical rectangular geometry is typically used in simulation engines.